ThisIsNotRocketScience/Syntonovo_PAN/controller/pan_sh/board/pin_mux.h
/*! @name PIO1_18 (number 5), SELC
  @{ */
#define BOARD_INITPINS_SELC_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SELC_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SELC_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SELC_GPIO_PIN 18U                       /*!<@brief PIO1 pin index: 18 */
#define BOARD_INITPINS_SELC_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SELC_PIN 18U                            /*!<@brief 1U pin index: 18 */
#define BOARD_INITPINS_SELC_CHANNEL 18                         /*!<@brief GPIO PIO1 channel: 18 */
#define BOARD_INITPINS_SELC_PIN_NAME PIO1_18                   /*!<@brief Pin name */
#define BOARD_INITPINS_SELC_LABEL "SELC"                       /*!<@brief Label */
#define BOARD_INITPINS_SELC_NAME "SELC"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_SELC_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

/*! @name PIO1_19 (number 16), SELA
  @{ */
#define BOARD_INITPINS_SELA_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SELA_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SELA_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SELA_GPIO_PIN 19U                       /*!<@brief PIO1 pin index: 19 */
#define BOARD_INITPINS_SELA_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SELA_PIN 19U                            /*!<@brief 1U pin index: 19 */
#define BOARD_INITPINS_SELA_CHANNEL 19                         /*!<@brief GPIO PIO1 channel: 19 */
#define BOARD_INITPINS_SELA_PIN_NAME PIO1_19                   /*!<@brief Pin name */
#define BOARD_INITPINS_SELA_LABEL "SELA"                       /*!<@brief Label */
#define BOARD_INITPINS_SELA_NAME "SELA"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_SELA_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

/*! @name PIO1_0 (number 29), GATE
  @{ */
#define BOARD_INITPINS_GATE_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_GATE_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_GATE_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_GATE_GPIO_PIN 0U                        /*!<@brief PIO1 pin index: 0 */
#define BOARD_INITPINS_GATE_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_GATE_PIN 0U                             /*!<@brief 1U pin index: 0 */
#define BOARD_INITPINS_GATE_CHANNEL 0                          /*!<@brief GPIO PIO1 channel: 0 */
#define BOARD_INITPINS_GATE_PIN_NAME PIO1_0                    /*!<@brief Pin name */
#define BOARD_INITPINS_GATE_LABEL "GATE"                       /*!<@brief Label */
#define BOARD_INITPINS_GATE_NAME "GATE"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_GATE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

/*! @name PIO0_31 (number 28), TUNE
  @{ */
#define BOARD_INITPINS_TUNE_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_TUNE_SIGNAL PIO0                       /*!<@brief GPIO signal: PIO0 */
#define BOARD_INITPINS_TUNE_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_TUNE_GPIO_PIN 31U                      /*!<@brief PIO0 pin index: 31 */
#define BOARD_INITPINS_TUNE_PORT 0U                           /*!<@brief PORT device name: 0U */
#define BOARD_INITPINS_TUNE_PIN 31U                           /*!<@brief 0U pin index: 31 */
#define BOARD_INITPINS_TUNE_CHANNEL 31                        /*!<@brief GPIO PIO0 channel: 31 */
#define BOARD_INITPINS_TUNE_PIN_NAME PIO0_31                  /*!<@brief Pin name */
#define BOARD_INITPINS_TUNE_LABEL "TUNE"                      /*!<@brief Label */
#define BOARD_INITPINS_TUNE_NAME "TUNE"                       /*!<@brief Identifier name */
#define BOARD_INITPINS_TUNE_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                              /* @} */

/*! @name PIO1_8 (number 36), SLATCH0
  @{ */
#define BOARD_INITPINS_SLATCH0_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SLATCH0_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SLATCH0_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SLATCH0_GPIO_PIN 8U                        /*!<@brief PIO1 pin index: 8 */
#define BOARD_INITPINS_SLATCH0_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SLATCH0_PIN 8U                             /*!<@brief 1U pin index: 8 */
#define BOARD_INITPINS_SLATCH0_CHANNEL 8                          /*!<@brief GPIO PIO1 channel: 8 */
#define BOARD_INITPINS_SLATCH0_PIN_NAME PIO1_8                    /*!<@brief Pin name */
#define BOARD_INITPINS_SLATCH0_LABEL "SLATCH0"                    /*!<@brief Label */
#define BOARD_INITPINS_SLATCH0_NAME "SLATCH0"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_SLATCH0_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PIO1_22 (number 43), FC2INT
  @{ */
#define BOARD_INITPINS_FC2_INT_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_FC2_INT_SIGNAL PIO1                       /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_FC2_INT_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_FC2_INT_GPIO_PIN 22U                      /*!<@brief PIO1 pin index: 22 */
#define BOARD_INITPINS_FC2_INT_PORT 1U                           /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_FC2_INT_PIN 22U                           /*!<@brief 1U pin index: 22 */
#define BOARD_INITPINS_FC2_INT_CHANNEL 22                        /*!<@brief GPIO PIO1 channel: 22 */
#define BOARD_INITPINS_FC2_INT_PIN_NAME PIO1_22                  /*!<@brief Pin name */
#define BOARD_INITPINS_FC2_INT_LABEL "FC2INT"                    /*!<@brief Label */
#define BOARD_INITPINS_FC2_INT_NAME "FC2_INT"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_FC2_INT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PIO1_17 (number 47), SELB
  @{ */
#define BOARD_INITPINS_SELB_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SELB_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SELB_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SELB_GPIO_PIN 17U                       /*!<@brief PIO1 pin index: 17 */
#define BOARD_INITPINS_SELB_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SELB_PIN 17U                            /*!<@brief 1U pin index: 17 */
#define BOARD_INITPINS_SELB_CHANNEL 17                         /*!<@brief GPIO PIO1 channel: 17 */
#define BOARD_INITPINS_SELB_PIN_NAME PIO1_17                   /*!<@brief Pin name */
#define BOARD_INITPINS_SELB_LABEL "SELB"                       /*!<@brief Label */
#define BOARD_INITPINS_SELB_NAME "SELB"                        /*!<@brief Identifier name */
#define BOARD_INITPINS_SELB_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

/*! @name PIO1_24 (number 57), SRESET2
  @{ */
#define BOARD_INITPINS_SRESET2_PERIPHERAL GPIO                    /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_SRESET2_SIGNAL PIO1                        /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_SRESET2_GPIO GPIO                          /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_SRESET2_GPIO_PIN 24U                       /*!<@brief PIO1 pin index: 24 */
#define BOARD_INITPINS_SRESET2_PORT 1U                            /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_SRESET2_PIN 24U                            /*!<@brief 1U pin index: 24 */
#define BOARD_INITPINS_SRESET2_CHANNEL 24                         /*!<@brief GPIO PIO1 channel: 24 */
#define BOARD_INITPINS_SRESET2_PIN_NAME PIO1_24                   /*!<@brief Pin name */
#define BOARD_INITPINS_SRESET2_LABEL "SRESET2"                    /*!<@brief Label */
#define BOARD_INITPINS_SRESET2_NAME "SRESET2"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_SRESET2_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

