ThisIsNotRocketScience/Syntonovo_PAN/controller/pan_sh/board/pin_mux.h
/*! @name PIO1_6 (number 15), TESTMODE
  @{ */
#define BOARD_INITPINS_TESTMODE_PERIPHERAL GPIO                   /*!<@brief Device name: GPIO */
#define BOARD_INITPINS_TESTMODE_SIGNAL PIO1                       /*!<@brief GPIO signal: PIO1 */
#define BOARD_INITPINS_TESTMODE_GPIO GPIO                         /*!<@brief GPIO device name: GPIO */
#define BOARD_INITPINS_TESTMODE_GPIO_PIN 6U                       /*!<@brief PIO1 pin index: 6 */
#define BOARD_INITPINS_TESTMODE_PORT 1U                           /*!<@brief PORT device name: 1U */
#define BOARD_INITPINS_TESTMODE_PIN 6U                            /*!<@brief 1U pin index: 6 */
#define BOARD_INITPINS_TESTMODE_CHANNEL 6                         /*!<@brief GPIO PIO1 channel: 6 */
#define BOARD_INITPINS_TESTMODE_PIN_NAME PIO1_6                   /*!<@brief Pin name */
#define BOARD_INITPINS_TESTMODE_LABEL "TESTMODE"                  /*!<@brief Label */
#define BOARD_INITPINS_TESTMODE_NAME "TESTMODE"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_TESTMODE_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
